<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'site_name'     => 'SharpDesign',

    'dev_thanks'     => 'Очень мило, что вы заглянули под капот моего сайта. Приятного просмотра!',
    'dev_me'         => 'Виталий',
    'dev_port'       => 'Портфолио разработчика',
    'dev_desc'       => 'Я - web-разработчик: создаю быстрые, функциональные и красивые сайты, осуществляю поддержку приложения после разработки, помогаю с настройкой модулей, расширений и плагинов. Сделаю для вас продающий сайт, который гарантированно принесет прибыль!',
    'dev_keywords'   => 'Профессиональная разработка приложений, создание сайтов, заказать сайт, разработка сайтов, создать приложение, изготавливать сайт, веб профессионал, программист, разработчик, портфолио, PHP, Javascript, jQuery, сайты где можно заказать, верстка, web-development, responsive web-development, frontend, backend, coding, sharp design',
    'dev_go'         => 'Перейти',
    'dev_more'       => 'Подробнее',
    'turn_js'        => 'Включите JavaScript, пожалуйста',
    
    'nav_to_home'    => 'На главную',
    'nav_home'       => 'Главная',
    'nav_home_desc'  => 'Краткая информация.',
    'nav_about_me'   => 'Обо мне',
    'nav_about_desc' => 'Немного информации обо мне.',
    'nav_portfolio'  => 'Портфолио',
    'nav_my_works'   => 'Мои работы',
    'nav_port_desc'  => 'Некоторые проекты, над которыми я работал.',
    'nav_experience' => 'Опыт',
    'nav_exp_desc'   => 'Мои навыки и способности.',
    'nav_to_home'    => 'На главную',
    'nav_blog'       => 'Блог',
    'nav_blog_desc'  => 'Мои статьи о разработке и дизайне.',
    'nav_nav_in'     => 'Мой профиль ЛинкедИн',
    'nav_connect'    => 'Связаться со мной',
    'nav_contacts'   => 'Контакты',
    
    'parts_port'     => 'Портфолио',
    'parts_web_dev'  => 'web-разработчика',
    'parts_position' => 'web-разработчик',
    
    'about_promo'    => 'Привет, меня зовут Виталий',
    'about_desc'     => 'Я - веб-разработчик широкого профиля. Создаю быстрые, функциональные и красивые приложения, специализируюсь на CMS и фреймворках на языке PHP. Сопровождаю разработку приложения начиная с концепии, заканчивая развертыванием на продакшн.',
    'about_suggest'  => 'Что я могу Вам предложить',
    'about_backend'  => 'Благодаря многолетнему опыту создания функциональных приложений, я могу гарантировать высокое качество и самоочевидность своего кода, а также модульность и высокую скорость работы сайта в целом.',
    'about_frontend' => 'Оптимизация клиентской стороны вашего приложения позволит не только повысить производительность сайта, но и гарантирует стабильное исполнение кода на разных устройствах.',
    
    'skills_level'   => 'Уровень моих навыков',
    'skills_more'    => 'Посмотреть больше навыков',
    
    'projects_title'     => 'Проекты',
    'projects_review'    => 'Обзор моих работ',
    'projects_meta_desc' => 'Здесь собраны проекты, над которыми я работал с описанием выполненных задач и ссылкой на сайт',
    'projects_desc'      => 'Здесь вы найдете проекты, над которыми я работал. В каждом проекте я добавил краткое описание его содержания и примененных технологий.',
    
    'proj_novozar'       => 'Новозариевка',
    'proj_novozar_desc'  => 'Сайт агрофирмы',
    'proj_drive_desc'    => 'Сайт транспортной компании',
    'proj_infoteh'       => 'ЧП "ИНФОТЕХ"',
    'proj_store'         => 'Интернет-магазин',
    'proj_mebel'         => 'Мебель-Донецк',
    'proj_website'       => 'Вебсайт',
    'proj_bus_desc'      => 'Транспортная компания',
    'proj_game'          => 'Игра',
    'proj_fift'          => 'Пятнашки',
    'proj_reset'         => 'Сброс',
    'proj_congrats'      => 'Поздравляю!',
    'proj_fift_title'    => 'Игра пятнашки на чистом JS',
    'proj_fift_desc'     => 'Простой и понятный скрипт игры пятнашки, написанный без использования сторонних библиотек',
    'proj_sheeps'        => 'Волк и овцы',
    'proj_provance'      => 'Прованс',
    'proj_provance_desc' => 'Сайт салона штор',

    'exp_meta_title'     => 'Мои навыки, сертификаты и опыт работы',
    'exp_meta_desc'      => 'Здесь собрана краткая информация о моем образовании, моих сертификатах и опыте работы',
    'exp_title'          => 'Мои навыки и уровень способностей',
    'exp_tru_date'       => 'С ноября 2020 года - по настоящее время',
    'exp_tru_job'        => 'Занимаюсь поддержкой проектов разного масштаба и сложности, среди которых есть, как крупные мультимагазины на PrestaShop и OpenCart, так и небольшие блоги на Wordpress.',
    'exp_cham'           => 'Рекламное агентство "Хамелеон"',
    'exp_cham_date'      => 'С июля 2020 года - по ноябрь 2020 года',
    'exp_cham_job'       => 'Разрабатывал сайты и приложения для клиентов компании. В большинстве случаев требовалось создать приложение с функционалом интернет-магазина либо витрины, работающее на CMS.',
    'exp_this_site'      => 'этот сайт',
    'exp_freelance'      => 'Фриланс проекты в сфере программирования и дизайна',
    'exp_freelance_date' => 'С июля 2019 года - по настоящее время',
    'exp_freelance_job'  => 'Я занимаюсь разработкой сайтов и приложений в свободное от основной работы время. Стараюсь писать чистый и понятный код, верстать высококачественные адаптивные сайты с легким и приятным дизайном.', 
    'exp_education'      => 'Образование',
    'exp_education_degr' => 'Полное высшее образование.',
    'exp_education_date' => 'Донецкий национальный университет 2006-2011 годы.',
    
    
    'footer_github'  => 'Аккаунт в GitHub',
    'footer_source'  => 'Посмотреть исходный код моих проектов',
    'footer_linkedin'=> 'Профиль в LinkedIn',
    'footer_career'  => 'Подробная информация о моей карьере',
    'footer_details' => 'Узнать детали сотрудничества',
    'footer_letter'  => 'Написать письмо',
];
